In [1]:
import pandas as pd
import numpy as np
import os
import datetime

print(datetime.datetime.now())
print(os.getcwd())

import sqlalchemy
BL_SQL_CONNECTION= 'mysql+pymysql://jian:JubaPlus-2017@localhost/BigLots' 
BL_engine = sqlalchemy.create_engine(
        BL_SQL_CONNECTION, 
        pool_recycle=1800
    )

# 2 parts: 1. Experian 2. EASI

2020-03-31 18:09:55.704115
/home/jian/Projects/Big_Lots/Analysis/2020_Q1/plannder_requests/JT_zips_income_crossvalidation_20200331

In [2]:
pd.read_sql("show tables;",con=BL_engine)

/usr/local/lib/python3.6/site-packages/pymysql/cursors.py:166: Warning: (1287, "'@@tx_isolation' is deprecated and will be removed in a future release. Please use '@@transaction_isolation' instead")
  result = self._query(query)

        Tables_in_BigLots
0             BL_POS_Item
1         BL_POS_Subclass
2       BL_Rewards_Master
3     Pred_Activity_BL_id
4     Pred_Activity_GU_id
5          Pred_CRM_table
6   Pred_ExposureV2_BL_id
7   Pred_ExposureV2_GU_id
8     Pred_Exposure_BL_id
9     Pred_Exposure_GU_id
10    Pred_POS_Department
11                   test

In [4]:
df_master_id_zip=pd.read_sql("select customer_id_hashed, customer_zip_code from BL_Rewards_Master",con=BL_engine).drop_duplicates()
print(df_master_id_zip.shape,df_master_id_zip['customer_id_hashed'].nunique())

(33771532, 2) 33771532

In [5]:
df_master_id_zip=df_master_id_zip.drop_duplicates("customer_id_hashed",keep="last")
print(df_master_id_zip.shape,df_master_id_zip['customer_id_hashed'].nunique())

(33771532, 2) 33771532

In [10]:
df_1_Experian=pd.read_csv("/home/jian/BigLots/Experian/data_20191016/Experian_20191001114500.txt",
                          dtype=str,sep="|",usecols=['CustomerNumber','IncomeId','IncomeDesc'])
df_1_mapping=pd.read_csv("/home/jian/BigLots/Experian/data_20191016/Experian 2019 customer hashed.txt",
                         dtype=str,sep="|")
print(df_1_Experian.shape,df_1_Experian['CustomerNumber'].nunique())
df_1_mapping=df_1_mapping.rename(columns={"Customer_Num":"CustomerNumber","hashed_customer_num":"customer_id_hashed"})
df_1_Experian=pd.merge(df_1_Experian,df_1_mapping,on="CustomerNumber",how="left")
del df_1_mapping

print(df_1_Experian.shape,df_1_Experian['customer_id_hashed'].nunique())

del df_1_Experian['CustomerNumber']
df_1_Experian.head(2)

(17626573, 3) 17626573
(17626573, 4) 17626573

,IncomeId,IncomeDesc,customer_id_hashed
0,2,between $50k and $100k,19581e27de7ced00ff1ce50b2047e7a567c76b1cbaebab...
1,3,>= $100k,59e19706d51d39f66711c2653cd7eb1291c94d9b55eb14...

In [11]:
df_1_Experian=pd.merge(df_1_Experian,df_master_id_zip,on="customer_id_hashed",how="left")
df_1_Experian.head(2)

,IncomeId,IncomeDesc,customer_id_hashed,customer_zip_code
0,2,between $50k and $100k,19581e27de7ced00ff1ce50b2047e7a567c76b1cbaebab...,32703
1,3,>= $100k,59e19706d51d39f66711c2653cd7eb1291c94d9b55eb14...,97326

In [12]:
import gc
del df_master_id_zip
gc.collect()

2349

In [13]:
df_1_Experian['customer_zip_code']=df_1_Experian['customer_zip_code'].fillna("00000")
df_1_Experian['customer_zip_code']=df_1_Experian['customer_zip_code'].apply(lambda x: x.split(" ")[0].split("-")[0].zfill(5)[:5])
print(df_1_Experian.shape,df_1_Experian['customer_id_hashed'].nunique())
# (17626573, 4) 17626573

In [17]:
df_1_output=df_1_Experian.groupby(['customer_zip_code','IncomeDesc'])['customer_id_hashed'].count().to_frame().reset_index()
df_1_output=df_1_output.pivot_table(index="customer_zip_code",columns="IncomeDesc",values="customer_id_hashed").reset_index()
df_1_output=df_1_output.fillna(0)
df_1_output.head(2)

IncomeDesc customer_zip_code    < $50k  >= $100k  between $50k and $100k
0                      00000  596485.0  436097.0                977171.0
1                      00001       1.0       0.0                     1.0

In [19]:
df_1_output.columns.tolist()

['customer_zip_code', '< $50k', '>= $100k', 'between $50k and $100k']

In [27]:
df_1_output['id_per_zip']=df_1_output['< $50k']+df_1_output['>= $100k']+df_1_output['between $50k and $100k']
df_1_output['below_50K_pctg']=df_1_output['< $50k']/df_1_output['id_per_zip']
df_1_output['50Kto100K_pctg']=df_1_output['between $50k and $100k']/df_1_output['id_per_zip']
df_1_output['above100K_pctg']=df_1_output['>= $100k']/df_1_output['id_per_zip']
df_1_output=df_1_output[['customer_zip_code','id_per_zip','< $50k', 'between $50k and $100k','>= $100k', 
                        'below_50K_pctg','50Kto100K_pctg','above100K_pctg']]
df_1_output.head(2)

IncomeDesc,customer_zip_code,id_per_zip,< $50k,between $50k and $100k,>= $100k,below_50K_pctg,50Kto100K_pctg,above100K_pctg
0,00000,2009753.0,596485.0,977171.0,436097.0,0.296795,0.486214,0.21699
1,00001,2.0,1.0,1.0,0.0,0.500000,0.500000,0.00000

In [28]:
del df_1_Experian
gc.collect()

40

In [32]:
df_2_EASI=pd.read_csv("/home/jian/Docs/EASI/2018-07-19/ZIP4_18_DATA_A2_CSV/ZIP4_18_DATA_A2.CSV",
                      skiprows=1,usecols=['ZIP_CODE','ZIP4','HH18','AVGHHINC'],dtype=str)
df_2_EASI['HH18']=df_2_EASI['HH18'].astype(float)
df_2_EASI['AVGHHINC']=df_2_EASI['AVGHHINC'].astype(int)
df_2_EASI['total_income']=df_2_EASI['HH18']*df_2_EASI['AVGHHINC']
df_2_EASI.head(2)

  ZIP_CODE  ZIP4  HH18  AVGHHINC  total_income
0    00501  0001   0.0         0           0.0
1    00501  0002   0.0         0           0.0

In [33]:
df_2_output=df_2_EASI.groupby("ZIP_CODE")['HH18','total_income'].sum().reset_index()
df_2_output.head(2)

  ZIP_CODE    HH18  total_income
0    00501     0.0  0.000000e+00
1    01001  6853.6  6.410444e+08

In [34]:
df_2_output['avg_incom_HH']=df_2_output['total_income']/df_2_output['HH18']
df_2_output=df_2_output.sort_values("avg_incom_HH")
print(df_2_output.shape)
df_2_output.head(2)

(39602, 4)

      ZIP_CODE   HH18  total_income  avg_incom_HH
36440    92402  364.4     5466364.4       15001.0
36988    93715   16.3      255062.4       15648.0

In [35]:
writer=pd.ExcelWriter("./BL_zip_cd_income_validation_JL_"+str(datetime.datetime.now().date())+".xlsx",engine="xlsxwriter")
df_1_output.to_excel(writer,"validate_1_BL_Exp_data",index=False)
df_2_output.to_excel(writer,"validate_1_JP_Zip4_data",index=False)
writer.save()